jbvalle/kx_regs/stm32f401re_regs.h
/* Auto-generated from SVD: cmsis-svd-stm32/stm32f4/STM32F401.svd */
#ifndef STM32F401_H
#define STM32F401_H

#include <stdint.h>

typedef struct {
    volatile uint32_t CSR         ; // 0x00 ADC Common status register
    volatile uint32_t CCR         ; // 0x04 ADC common control register
} ADC_COMMON_TypeDef;

#define ADC_COMMON   ((ADC_COMMON_TypeDef *) 0x40012300UL)

typedef struct {
    volatile uint32_t SR          ; // 0x00 status register
    volatile uint32_t CR1         ; // 0x04 control register 1
    volatile uint32_t CR2         ; // 0x08 control register 2
    volatile uint32_t SMPR1       ; // 0x0C sample time register 1
    volatile uint32_t SMPR2       ; // 0x10 sample time register 2
    volatile uint32_t JOFR1       ; // 0x14 injected channel data offset register
    volatile uint32_t JOFR2       ; // 0x18 injected channel data offset register
    volatile uint32_t JOFR3       ; // 0x1C injected channel data offset register
    volatile uint32_t JOFR4       ; // 0x20 injected channel data offset register
    volatile uint32_t HTR         ; // 0x24 watchdog higher threshold register
    volatile uint32_t LTR         ; // 0x28 watchdog lower threshold register
    volatile uint32_t SQR1        ; // 0x2C regular sequence register 1
    volatile uint32_t SQR2        ; // 0x30 regular sequence register 2
    volatile uint32_t SQR3        ; // 0x34 regular sequence register 3
    volatile uint32_t JSQR        ; // 0x38 injected sequence register
    volatile uint32_t JDR1        ; // 0x3C injected data register
    volatile uint32_t JDR2        ; // 0x40 injected data register
    volatile uint32_t JDR3        ; // 0x44 injected data register
    volatile uint32_t JDR4        ; // 0x48 injected data register
    volatile uint32_t DR          ; // 0x4C regular data register
} ADC1_TypeDef;

#define ADC1   ((ADC1_TypeDef *) 0x40012000UL)

typedef struct {
    volatile uint32_t DR          ; // 0x00 Data register
    volatile uint32_t IDR         ; // 0x04 Independent Data register
    volatile uint32_t CR          ; // 0x08 Control register
} CRC_TypeDef;

#define CRC   ((CRC_TypeDef *) 0x40023000UL)

typedef struct {
    volatile uint32_t DBGMCU_IDCODE; // 0x00 IDCODE
    volatile uint32_t DBGMCU_CR   ; // 0x04 Control Register
    volatile uint32_t DBGMCU_APB1_FZ; // 0x08 Debug MCU APB1 Freeze registe
    volatile uint32_t DBGMCU_APB2_FZ; // 0x0C Debug MCU APB2 Freeze registe
} DBG_TypeDef;

#define DBG   ((DBG_TypeDef *) 0xE0042000UL)

typedef struct {
    volatile uint32_t IMR         ; // 0x00 Interrupt mask register (EXTI_IMR)
    volatile uint32_t EMR         ; // 0x04 Event mask register (EXTI_EMR)
    volatile uint32_t RTSR        ; // 0x08 Rising Trigger selection register (EXTI_RTSR)
    volatile uint32_t FTSR        ; // 0x0C Falling Trigger selection register (EXTI_FTSR)
    volatile uint32_t SWIER       ; // 0x10 Software interrupt event register (EXTI_SWIER)
    volatile uint32_t PR          ; // 0x14 Pending register (EXTI_PR)
} EXTI_TypeDef;

#define EXTI   ((EXTI_TypeDef *) 0x40013C00UL)

typedef struct {
    volatile uint32_t ACR         ; // 0x00 Flash access control register
    volatile uint32_t KEYR        ; // 0x04 Flash key register
    volatile uint32_t OPTKEYR     ; // 0x08 Flash option key register
    volatile uint32_t SR          ; // 0x0C Status register
    volatile uint32_t CR          ; // 0x10 Control register
    volatile uint32_t OPTCR       ; // 0x14 Flash option control register
} FLASH_TypeDef;

#define FLASH   ((FLASH_TypeDef *) 0x40023C00UL)

typedef struct {
    volatile uint32_t KR          ; // 0x00 Key register
    volatile uint32_t PR          ; // 0x04 Prescaler register
    volatile uint32_t RLR         ; // 0x08 Reload register
    volatile uint32_t SR          ; // 0x0C Status register
} IWDG_TypeDef;

#define IWDG   ((IWDG_TypeDef *) 0x40003000UL)

typedef struct {
    volatile uint32_t FS_DCFG     ; // 0x00 OTG_FS device configuration register (OTG_FS_DCFG)
    volatile uint32_t FS_DCTL     ; // 0x04 OTG_FS device control register (OTG_FS_DCTL)
    volatile uint32_t FS_DSTS     ; // 0x08 OTG_FS device status register (OTG_FS_DSTS)
    volatile uint32_t RESERVED_0[1]; // 0x0C - 0x0F
    volatile uint32_t FS_DIEPMSK  ; // 0x10 OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK)
    volatile uint32_t FS_DOEPMSK  ; // 0x14 OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK)
    volatile uint32_t FS_DAINT    ; // 0x18 OTG_FS device all endpoints interrupt register (OTG_FS_DAINT)
    volatile uint32_t FS_DAINTMSK ; // 0x1C OTG_FS all endpoints interrupt mask register (OTG_FS_DAINTMSK)
    volatile uint32_t RESERVED_1[2]; // 0x20 - 0x27
    volatile uint32_t DVBUSDIS    ; // 0x28 OTG_FS device VBUS discharge time register
    volatile uint32_t DVBUSPULSE  ; // 0x2C OTG_FS device VBUS pulsing time register
    volatile uint32_t RESERVED_2[1]; // 0x30 - 0x33
    volatile uint32_t DIEPEMPMSK  ; // 0x34 OTG_FS device IN endpoint FIFO empty interrupt mask register
    volatile uint32_t RESERVED_3[50]; // 0x38 - 0xFF
    volatile uint32_t FS_DIEPCTL0 ; // 0x100 OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0)
    volatile uint32_t RESERVED_4[1]; // 0x104 - 0x107
    volatile uint32_t DIEPINT0    ; // 0x108 device endpoint-interrupt register
    volatile uint32_t RESERVED_5[1]; // 0x10C - 0x10F
    volatile uint32_t DIEPTSIZ0   ; // 0x110 device endpoint-0 transfer size register
    volatile uint32_t RESERVED_6[1]; // 0x114 - 0x117
    volatile uint32_t DTXFSTS0    ; // 0x118 OTG_FS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_7[1]; // 0x11C - 0x11F
    volatile uint32_t DIEPCTL1    ; // 0x120 OTG device endpoint-1 control register
    volatile uint32_t RESERVED_8[1]; // 0x124 - 0x127
    volatile uint32_t DIEPINT1    ; // 0x128 device endpoint-1 interrupt register
    volatile uint32_t RESERVED_9[1]; // 0x12C - 0x12F
    volatile uint32_t DIEPTSIZ1   ; // 0x130 device endpoint-1 transfer size register
    volatile uint32_t RESERVED_10[1]; // 0x134 - 0x137
    volatile uint32_t DTXFSTS1    ; // 0x138 OTG_FS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_11[1]; // 0x13C - 0x13F
    volatile uint32_t DIEPCTL2    ; // 0x140 OTG device endpoint-2 control register
    volatile uint32_t RESERVED_12[1]; // 0x144 - 0x147
    volatile uint32_t DIEPINT2    ; // 0x148 device endpoint-2 interrupt register
    volatile uint32_t RESERVED_13[1]; // 0x14C - 0x14F
    volatile uint32_t DIEPTSIZ2   ; // 0x150 device endpoint-2 transfer size register
    volatile uint32_t RESERVED_14[1]; // 0x154 - 0x157
    volatile uint32_t DTXFSTS2    ; // 0x158 OTG_FS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_15[1]; // 0x15C - 0x15F
    volatile uint32_t DIEPCTL3    ; // 0x160 OTG device endpoint-3 control register
    volatile uint32_t RESERVED_16[1]; // 0x164 - 0x167
    volatile uint32_t DIEPINT3    ; // 0x168 device endpoint-3 interrupt register
    volatile uint32_t RESERVED_17[1]; // 0x16C - 0x16F
    volatile uint32_t DIEPTSIZ3   ; // 0x170 device endpoint-3 transfer size register
    volatile uint32_t RESERVED_18[1]; // 0x174 - 0x177
    volatile uint32_t DTXFSTS3    ; // 0x178 OTG_FS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_19[97]; // 0x17C - 0x2FF
    volatile uint32_t DOEPCTL0    ; // 0x300 device endpoint-0 control register
    volatile uint32_t RESERVED_20[1]; // 0x304 - 0x307
    volatile uint32_t DOEPINT0    ; // 0x308 device endpoint-0 interrupt register
    volatile uint32_t RESERVED_21[1]; // 0x30C - 0x30F
    volatile uint32_t DOEPTSIZ0   ; // 0x310 device OUT endpoint-0 transfer size register
    volatile uint32_t RESERVED_22[3]; // 0x314 - 0x31F
    volatile uint32_t DOEPCTL1    ; // 0x320 device endpoint-1 control register
    volatile uint32_t RESERVED_23[1]; // 0x324 - 0x327
    volatile uint32_t DOEPINT1    ; // 0x328 device endpoint-1 interrupt register
    volatile uint32_t RESERVED_24[1]; // 0x32C - 0x32F
    volatile uint32_t DOEPTSIZ1   ; // 0x330 device OUT endpoint-1 transfer size register
    volatile uint32_t RESERVED_25[3]; // 0x334 - 0x33F
    volatile uint32_t DOEPCTL2    ; // 0x340 device endpoint-2 control register
    volatile uint32_t RESERVED_26[1]; // 0x344 - 0x347
    volatile uint32_t DOEPINT2    ; // 0x348 device endpoint-2 interrupt register
    volatile uint32_t RESERVED_27[1]; // 0x34C - 0x34F
    volatile uint32_t DOEPTSIZ2   ; // 0x350 device OUT endpoint-2 transfer size register
    volatile uint32_t RESERVED_28[3]; // 0x354 - 0x35F
    volatile uint32_t DOEPCTL3    ; // 0x360 device endpoint-3 control register
    volatile uint32_t RESERVED_29[1]; // 0x364 - 0x367
    volatile uint32_t DOEPINT3    ; // 0x368 device endpoint-3 interrupt register
    volatile uint32_t RESERVED_30[1]; // 0x36C - 0x36F
    volatile uint32_t DOEPTSIZ3   ; // 0x370 device OUT endpoint-3 transfer size register
} OTG_FS_DEVICE_TypeDef;

