jbvalle/kx_regs/stm32f401re_regs.h
#define OTG_FS_DEVICE   ((OTG_FS_DEVICE_TypeDef *) 0x50000800UL)

typedef struct {
    volatile uint32_t FS_GOTGCTL  ; // 0x00 OTG_FS control and status register (OTG_FS_GOTGCTL)
    volatile uint32_t FS_GOTGINT  ; // 0x04 OTG_FS interrupt register (OTG_FS_GOTGINT)
    volatile uint32_t FS_GAHBCFG  ; // 0x08 OTG_FS AHB configuration register (OTG_FS_GAHBCFG)
    volatile uint32_t FS_GUSBCFG  ; // 0x0C OTG_FS USB configuration register (OTG_FS_GUSBCFG)
    volatile uint32_t FS_GRSTCTL  ; // 0x10 OTG_FS reset register (OTG_FS_GRSTCTL)
    volatile uint32_t FS_GINTSTS  ; // 0x14 OTG_FS core interrupt register (OTG_FS_GINTSTS)
    volatile uint32_t FS_GINTMSK  ; // 0x18 OTG_FS interrupt mask register (OTG_FS_GINTMSK)
    volatile uint32_t FS_GRXSTSR_Device; // 0x1C OTG_FS Receive status debug read(Device mode)
    volatile uint32_t FS_GRXSTSR_Host; // 0x1C OTG_FS Receive status debug read(Host mode)
    volatile uint32_t RESERVED_0[1]; // 0x20 - 0x23
    volatile uint32_t FS_GRXFSIZ  ; // 0x24 OTG_FS Receive FIFO size register (OTG_FS_GRXFSIZ)
    volatile uint32_t FS_GNPTXFSIZ_Device; // 0x28 OTG_FS non-periodic transmit FIFO size register (Device mode)
    volatile uint32_t FS_GNPTXFSIZ_Host; // 0x28 OTG_FS non-periodic transmit FIFO size register (Host mode)
    volatile uint32_t FS_GNPTXSTS ; // 0x2C OTG_FS non-periodic transmit FIFO/queue status register (OTG_FS_GNPTXSTS)
    volatile uint32_t RESERVED_1[2]; // 0x30 - 0x37
    volatile uint32_t FS_GCCFG    ; // 0x38 OTG_FS general core configuration register (OTG_FS_GCCFG)
    volatile uint32_t FS_CID      ; // 0x3C core ID register
    volatile uint32_t RESERVED_2[48]; // 0x40 - 0xFF
    volatile uint32_t FS_HPTXFSIZ ; // 0x100 OTG_FS Host periodic transmit FIFO size register (OTG_FS_HPTXFSIZ)
    volatile uint32_t FS_DIEPTXF1 ; // 0x104 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF2)
    volatile uint32_t FS_DIEPTXF2 ; // 0x108 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF3)
    volatile uint32_t FS_DIEPTXF3 ; // 0x10C OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF4)
} OTG_FS_GLOBAL_TypeDef;

#define OTG_FS_GLOBAL   ((OTG_FS_GLOBAL_TypeDef *) 0x50000000UL)

typedef struct {
    volatile uint32_t FS_HCFG     ; // 0x00 OTG_FS host configuration register (OTG_FS_HCFG)
    volatile uint32_t HFIR        ; // 0x04 OTG_FS Host frame interval register
    volatile uint32_t FS_HFNUM    ; // 0x08 OTG_FS host frame number/frame time remaining register (OTG_FS_HFNUM)
    volatile uint32_t RESERVED_0[1]; // 0x0C - 0x0F
    volatile uint32_t FS_HPTXSTS  ; // 0x10 OTG_FS_Host periodic transmit FIFO/queue status register (OTG_FS_HPTXSTS)
    volatile uint32_t HAINT       ; // 0x14 OTG_FS Host all channels interrupt register
    volatile uint32_t HAINTMSK    ; // 0x18 OTG_FS host all channels interrupt mask register
    volatile uint32_t RESERVED_1[9]; // 0x1C - 0x3F
    volatile uint32_t FS_HPRT     ; // 0x40 OTG_FS host port control and status register (OTG_FS_HPRT)
    volatile uint32_t RESERVED_2[47]; // 0x44 - 0xFF
    volatile uint32_t FS_HCCHAR0  ; // 0x100 OTG_FS host channel-0 characteristics register (OTG_FS_HCCHAR0)
    volatile uint32_t RESERVED_3[1]; // 0x104 - 0x107
    volatile uint32_t FS_HCINT0   ; // 0x108 OTG_FS host channel-0 interrupt register (OTG_FS_HCINT0)
    volatile uint32_t FS_HCINTMSK0; // 0x10C OTG_FS host channel-0 mask register (OTG_FS_HCINTMSK0)
    volatile uint32_t FS_HCTSIZ0  ; // 0x110 OTG_FS host channel-0 transfer size register
    volatile uint32_t RESERVED_4[3]; // 0x114 - 0x11F
    volatile uint32_t FS_HCCHAR1  ; // 0x120 OTG_FS host channel-1 characteristics register (OTG_FS_HCCHAR1)
    volatile uint32_t RESERVED_5[1]; // 0x124 - 0x127
    volatile uint32_t FS_HCINT1   ; // 0x128 OTG_FS host channel-1 interrupt register (OTG_FS_HCINT1)
    volatile uint32_t FS_HCINTMSK1; // 0x12C OTG_FS host channel-1 mask register (OTG_FS_HCINTMSK1)
    volatile uint32_t FS_HCTSIZ1  ; // 0x130 OTG_FS host channel-1 transfer size register
    volatile uint32_t RESERVED_6[3]; // 0x134 - 0x13F
    volatile uint32_t FS_HCCHAR2  ; // 0x140 OTG_FS host channel-2 characteristics register (OTG_FS_HCCHAR2)
    volatile uint32_t RESERVED_7[1]; // 0x144 - 0x147
    volatile uint32_t FS_HCINT2   ; // 0x148 OTG_FS host channel-2 interrupt register (OTG_FS_HCINT2)
    volatile uint32_t FS_HCINTMSK2; // 0x14C OTG_FS host channel-2 mask register (OTG_FS_HCINTMSK2)
    volatile uint32_t FS_HCTSIZ2  ; // 0x150 OTG_FS host channel-2 transfer size register
    volatile uint32_t RESERVED_8[3]; // 0x154 - 0x15F
    volatile uint32_t FS_HCCHAR3  ; // 0x160 OTG_FS host channel-3 characteristics register (OTG_FS_HCCHAR3)
    volatile uint32_t RESERVED_9[1]; // 0x164 - 0x167
    volatile uint32_t FS_HCINT3   ; // 0x168 OTG_FS host channel-3 interrupt register (OTG_FS_HCINT3)
    volatile uint32_t FS_HCINTMSK3; // 0x16C OTG_FS host channel-3 mask register (OTG_FS_HCINTMSK3)
    volatile uint32_t FS_HCTSIZ3  ; // 0x170 OTG_FS host channel-3 transfer size register
    volatile uint32_t RESERVED_10[3]; // 0x174 - 0x17F
    volatile uint32_t FS_HCCHAR4  ; // 0x180 OTG_FS host channel-4 characteristics register (OTG_FS_HCCHAR4)
    volatile uint32_t RESERVED_11[1]; // 0x184 - 0x187
    volatile uint32_t FS_HCINT4   ; // 0x188 OTG_FS host channel-4 interrupt register (OTG_FS_HCINT4)
    volatile uint32_t FS_HCINTMSK4; // 0x18C OTG_FS host channel-4 mask register (OTG_FS_HCINTMSK4)
    volatile uint32_t FS_HCTSIZ4  ; // 0x190 OTG_FS host channel-transfer size register
    volatile uint32_t RESERVED_12[3]; // 0x194 - 0x19F
    volatile uint32_t FS_HCCHAR5  ; // 0x1A0 OTG_FS host channel-5 characteristics register (OTG_FS_HCCHAR5)
    volatile uint32_t RESERVED_13[1]; // 0x1A4 - 0x1A7
    volatile uint32_t FS_HCINT5   ; // 0x1A8 OTG_FS host channel-5 interrupt register (OTG_FS_HCINT5)
    volatile uint32_t FS_HCINTMSK5; // 0x1AC OTG_FS host channel-5 mask register (OTG_FS_HCINTMSK5)
    volatile uint32_t FS_HCTSIZ5  ; // 0x1B0 OTG_FS host channel-5 transfer size register
    volatile uint32_t RESERVED_14[3]; // 0x1B4 - 0x1BF
    volatile uint32_t FS_HCCHAR6  ; // 0x1C0 OTG_FS host channel-6 characteristics register (OTG_FS_HCCHAR6)
    volatile uint32_t RESERVED_15[1]; // 0x1C4 - 0x1C7
    volatile uint32_t FS_HCINT6   ; // 0x1C8 OTG_FS host channel-6 interrupt register (OTG_FS_HCINT6)
    volatile uint32_t FS_HCINTMSK6; // 0x1CC OTG_FS host channel-6 mask register (OTG_FS_HCINTMSK6)
    volatile uint32_t FS_HCTSIZ6  ; // 0x1D0 OTG_FS host channel-6 transfer size register
    volatile uint32_t RESERVED_16[3]; // 0x1D4 - 0x1DF
    volatile uint32_t FS_HCCHAR7  ; // 0x1E0 OTG_FS host channel-7 characteristics register (OTG_FS_HCCHAR7)
    volatile uint32_t RESERVED_17[1]; // 0x1E4 - 0x1E7
    volatile uint32_t FS_HCINT7   ; // 0x1E8 OTG_FS host channel-7 interrupt register (OTG_FS_HCINT7)
    volatile uint32_t FS_HCINTMSK7; // 0x1EC OTG_FS host channel-7 mask register (OTG_FS_HCINTMSK7)
    volatile uint32_t FS_HCTSIZ7  ; // 0x1F0 OTG_FS host channel-7 transfer size register
} OTG_FS_HOST_TypeDef;

#define OTG_FS_HOST   ((OTG_FS_HOST_TypeDef *) 0x50000400UL)

