jbvalle/kx_regs/stm32f401re_regs.h
typedef struct {
    volatile uint32_t FS_PCGCCTL  ; // 0x00 OTG_FS power and clock gating control register
} OTG_FS_PWRCLK_TypeDef;

#define OTG_FS_PWRCLK   ((OTG_FS_PWRCLK_TypeDef *) 0x50000E00UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 power control register
    volatile uint32_t CSR         ; // 0x04 power control/status register
} PWR_TypeDef;

#define PWR   ((PWR_TypeDef *) 0x40007000UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 clock control register
    volatile uint32_t PLLCFGR     ; // 0x04 PLL configuration register
    volatile uint32_t CFGR        ; // 0x08 clock configuration register
    volatile uint32_t CIR         ; // 0x0C clock interrupt register
    volatile uint32_t AHB1RSTR    ; // 0x10 AHB1 peripheral reset register
    volatile uint32_t AHB2RSTR    ; // 0x14 AHB2 peripheral reset register
    volatile uint32_t RESERVED_0[2]; // 0x18 - 0x1F
    volatile uint32_t APB1RSTR    ; // 0x20 APB1 peripheral reset register
    volatile uint32_t APB2RSTR    ; // 0x24 APB2 peripheral reset register
    volatile uint32_t RESERVED_1[2]; // 0x28 - 0x2F
    volatile uint32_t AHB1ENR     ; // 0x30 AHB1 peripheral clock register
    volatile uint32_t AHB2ENR     ; // 0x34 AHB2 peripheral clock enable register
    volatile uint32_t RESERVED_2[2]; // 0x38 - 0x3F
    volatile uint32_t APB1ENR     ; // 0x40 APB1 peripheral clock enable register
    volatile uint32_t APB2ENR     ; // 0x44 APB2 peripheral clock enable register
    volatile uint32_t RESERVED_3[2]; // 0x48 - 0x4F
    volatile uint32_t AHB1LPENR   ; // 0x50 AHB1 peripheral clock enable in low power mode register
    volatile uint32_t AHB2LPENR   ; // 0x54 AHB2 peripheral clock enable in low power mode register
    volatile uint32_t RESERVED_4[2]; // 0x58 - 0x5F
    volatile uint32_t APB1LPENR   ; // 0x60 APB1 peripheral clock enable in low power mode register
    volatile uint32_t APB2LPENR   ; // 0x64 APB2 peripheral clock enabled in low power mode register
    volatile uint32_t RESERVED_5[2]; // 0x68 - 0x6F
    volatile uint32_t BDCR        ; // 0x70 Backup domain control register
    volatile uint32_t CSR         ; // 0x74 clock control & status register
    volatile uint32_t RESERVED_6[2]; // 0x78 - 0x7F
    volatile uint32_t SSCGR       ; // 0x80 spread spectrum clock generation register
    volatile uint32_t PLLI2SCFGR  ; // 0x84 PLLI2S configuration register
} RCC_TypeDef;

#define RCC   ((RCC_TypeDef *) 0x40023800UL)

typedef struct {
    volatile uint32_t TR          ; // 0x00 time register
    volatile uint32_t DR          ; // 0x04 date register
    volatile uint32_t CR          ; // 0x08 control register
    volatile uint32_t ISR         ; // 0x0C initialization and status register
    volatile uint32_t PRER        ; // 0x10 prescaler register
    volatile uint32_t WUTR        ; // 0x14 wakeup timer register
    volatile uint32_t CALIBR      ; // 0x18 calibration register
    volatile uint32_t ALRMAR      ; // 0x1C alarm A register
    volatile uint32_t ALRMBR      ; // 0x20 alarm B register
    volatile uint32_t WPR         ; // 0x24 write protection register
    volatile uint32_t SSR         ; // 0x28 sub second register
    volatile uint32_t SHIFTR      ; // 0x2C shift control register
    volatile uint32_t TSTR        ; // 0x30 time stamp time register
    volatile uint32_t TSDR        ; // 0x34 time stamp date register
    volatile uint32_t TSSSR       ; // 0x38 timestamp sub second register
    volatile uint32_t CALR        ; // 0x3C calibration register
    volatile uint32_t TAFCR       ; // 0x40 tamper and alternate function configuration register
    volatile uint32_t ALRMASSR    ; // 0x44 alarm A sub second register
    volatile uint32_t ALRMBSSR    ; // 0x48 alarm B sub second register
    volatile uint32_t RESERVED_0[1]; // 0x4C - 0x4F
    volatile uint32_t BKP0R       ; // 0x50 backup register
    volatile uint32_t BKP1R       ; // 0x54 backup register
    volatile uint32_t BKP2R       ; // 0x58 backup register
    volatile uint32_t BKP3R       ; // 0x5C backup register
    volatile uint32_t BKP4R       ; // 0x60 backup register
    volatile uint32_t BKP5R       ; // 0x64 backup register
    volatile uint32_t BKP6R       ; // 0x68 backup register
    volatile uint32_t BKP7R       ; // 0x6C backup register
    volatile uint32_t BKP8R       ; // 0x70 backup register
    volatile uint32_t BKP9R       ; // 0x74 backup register
    volatile uint32_t BKP10R      ; // 0x78 backup register
    volatile uint32_t BKP11R      ; // 0x7C backup register
    volatile uint32_t BKP12R      ; // 0x80 backup register
    volatile uint32_t BKP13R      ; // 0x84 backup register
    volatile uint32_t BKP14R      ; // 0x88 backup register
    volatile uint32_t BKP15R      ; // 0x8C backup register
    volatile uint32_t BKP16R      ; // 0x90 backup register
    volatile uint32_t BKP17R      ; // 0x94 backup register
    volatile uint32_t BKP18R      ; // 0x98 backup register
    volatile uint32_t BKP19R      ; // 0x9C backup register
} RTC_TypeDef;

#define RTC   ((RTC_TypeDef *) 0x40002800UL)

typedef struct {
    volatile uint32_t POWER       ; // 0x00 power control register
    volatile uint32_t CLKCR       ; // 0x04 SDI clock control register
    volatile uint32_t ARG         ; // 0x08 argument register
    volatile uint32_t CMD         ; // 0x0C command register
    volatile uint32_t RESPCMD     ; // 0x10 command response register
    volatile uint32_t RESP1       ; // 0x14 response 1..4 register
    volatile uint32_t RESP2       ; // 0x18 response 1..4 register
    volatile uint32_t RESP3       ; // 0x1C response 1..4 register
    volatile uint32_t RESP4       ; // 0x20 response 1..4 register
    volatile uint32_t DTIMER      ; // 0x24 data timer register
    volatile uint32_t DLEN        ; // 0x28 data length register
    volatile uint32_t DCTRL       ; // 0x2C data control register
    volatile uint32_t DCOUNT      ; // 0x30 data counter register
    volatile uint32_t STA         ; // 0x34 status register
    volatile uint32_t ICR         ; // 0x38 interrupt clear register
    volatile uint32_t MASK        ; // 0x3C mask register
    volatile uint32_t RESERVED_0[2]; // 0x40 - 0x47
    volatile uint32_t FIFOCNT     ; // 0x48 FIFO counter register
    volatile uint32_t RESERVED_1[13]; // 0x4C - 0x7F
    volatile uint32_t FIFO        ; // 0x80 data FIFO register
} SDIO_TypeDef;

#define SDIO   ((SDIO_TypeDef *) 0x40012C00UL)

