jbvalle/kx_regs/stm32f401re_regs.h
typedef struct {
    volatile uint32_t MEMRM       ; // 0x00 memory remap register
    volatile uint32_t PMC         ; // 0x04 peripheral mode configuration register
    volatile uint32_t EXTICR1     ; // 0x08 external interrupt configuration register 1
    volatile uint32_t EXTICR2     ; // 0x0C external interrupt configuration register 2
    volatile uint32_t EXTICR3     ; // 0x10 external interrupt configuration register 3
    volatile uint32_t EXTICR4     ; // 0x14 external interrupt configuration register 4
    volatile uint32_t RESERVED_0[2]; // 0x18 - 0x1F
    volatile uint32_t CMPCR       ; // 0x20 Compensation cell control register
} SYSCFG_TypeDef;

#define SYSCFG   ((SYSCFG_TypeDef *) 0x40013800UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t CCMR2_Output; // 0x1C capture/compare mode register 2 (output mode)
    volatile uint32_t CCMR2_Input ; // 0x1C capture/compare mode register 2 (input mode)
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RCR         ; // 0x30 repetition counter register
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
    volatile uint32_t CCR3        ; // 0x3C capture/compare register 3
    volatile uint32_t CCR4        ; // 0x40 capture/compare register 4
    volatile uint32_t BDTR        ; // 0x44 break and dead-time register
    volatile uint32_t DCR         ; // 0x48 DMA control register
    volatile uint32_t DMAR        ; // 0x4C DMA address for full transfer
} TIM1_TypeDef;

#define TIM1   ((TIM1_TypeDef *) 0x40010000UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t RESERVED_0[2]; // 0x04 - 0x0B
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t RESERVED_1[1]; // 0x1C - 0x1F
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_2[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
} TIM10_TypeDef;

#define TIM10   ((TIM10_TypeDef *) 0x40014400UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t RESERVED_0[2]; // 0x04 - 0x0B
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t RESERVED_1[1]; // 0x1C - 0x1F
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_2[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t RESERVED_3[6]; // 0x38 - 0x4F
    volatile uint32_t OR          ; // 0x50 option register
} TIM11_TypeDef;

#define TIM11   ((TIM11_TypeDef *) 0x40014800UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t CCMR2_Output; // 0x1C capture/compare mode register 2 (output mode)
    volatile uint32_t CCMR2_Input ; // 0x1C capture/compare mode register 2 (input mode)
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_0[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
    volatile uint32_t CCR3        ; // 0x3C capture/compare register 3
    volatile uint32_t CCR4        ; // 0x40 capture/compare register 4
    volatile uint32_t RESERVED_1[1]; // 0x44 - 0x47
    volatile uint32_t DCR         ; // 0x48 DMA control register
    volatile uint32_t DMAR        ; // 0x4C DMA address for full transfer
    volatile uint32_t OR          ; // 0x50 TIM5 option register
} TIM2_TypeDef;

#define TIM2   ((TIM2_TypeDef *) 0x40000000UL)

