jbvalle/kx_regs/stm32f401re_regs.h
typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t CCMR2_Output; // 0x1C capture/compare mode register 2 (output mode)
    volatile uint32_t CCMR2_Input ; // 0x1C capture/compare mode register 2 (input mode)
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_0[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
    volatile uint32_t CCR3        ; // 0x3C capture/compare register 3
    volatile uint32_t CCR4        ; // 0x40 capture/compare register 4
    volatile uint32_t RESERVED_1[1]; // 0x44 - 0x47
    volatile uint32_t DCR         ; // 0x48 DMA control register
    volatile uint32_t DMAR        ; // 0x4C DMA address for full transfer
} TIM3_TypeDef;

#define TIM3   ((TIM3_TypeDef *) 0x40000400UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t CCMR2_Output; // 0x1C capture/compare mode register 2 (output mode)
    volatile uint32_t CCMR2_Input ; // 0x1C capture/compare mode register 2 (input mode)
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_0[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
    volatile uint32_t CCR3        ; // 0x3C capture/compare register 3
    volatile uint32_t CCR4        ; // 0x40 capture/compare register 4
    volatile uint32_t RESERVED_1[1]; // 0x44 - 0x47
    volatile uint32_t DCR         ; // 0x48 DMA control register
    volatile uint32_t DMAR        ; // 0x4C DMA address for full transfer
    volatile uint32_t OR          ; // 0x50 TIM5 option register
} TIM5_TypeDef;

#define TIM5   ((TIM5_TypeDef *) 0x40000C00UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t RESERVED_0[1]; // 0x1C - 0x1F
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_1[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
} TIM9_TypeDef;

#define TIM9   ((TIM9_TypeDef *) 0x40014000UL)

typedef struct {
    volatile uint32_t SR          ; // 0x00 Status register
    volatile uint32_t DR          ; // 0x04 Data register
    volatile uint32_t BRR         ; // 0x08 Baud rate register
    volatile uint32_t CR1         ; // 0x0C Control register 1
    volatile uint32_t CR2         ; // 0x10 Control register 2
    volatile uint32_t CR3         ; // 0x14 Control register 3
    volatile uint32_t GTPR        ; // 0x18 Guard time and prescaler register
} USART1_TypeDef;

#define USART1   ((USART1_TypeDef *) 0x40011000UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 Control register
    volatile uint32_t CFR         ; // 0x04 Configuration register
    volatile uint32_t SR          ; // 0x08 Status register
} WWDG_TypeDef;

#define WWDG   ((WWDG_TypeDef *) 0x40002C00UL)

typedef struct {
    volatile uint32_t LISR        ; // 0x00 low interrupt status register
    volatile uint32_t HISR        ; // 0x04 high interrupt status register
    volatile uint32_t LIFCR       ; // 0x08 low interrupt flag clear register
    volatile uint32_t HIFCR       ; // 0x0C high interrupt flag clear register
    volatile uint32_t S0CR        ; // 0x10 stream configuration register
    volatile uint32_t S0NDTR      ; // 0x14 stream number of data register
    volatile uint32_t S0PAR       ; // 0x18 stream peripheral address register
    volatile uint32_t S0M0AR      ; // 0x1C stream memory 0 address register
    volatile uint32_t S0M1AR      ; // 0x20 stream memory 1 address register
    volatile uint32_t S0FCR       ; // 0x24 stream FIFO control register
    volatile uint32_t S1CR        ; // 0x28 stream configuration register
    volatile uint32_t S1NDTR      ; // 0x2C stream number of data register
    volatile uint32_t S1PAR       ; // 0x30 stream peripheral address register
    volatile uint32_t S1M0AR      ; // 0x34 stream memory 0 address register
    volatile uint32_t S1M1AR      ; // 0x38 stream memory 1 address register
    volatile uint32_t S1FCR       ; // 0x3C stream FIFO control register
    volatile uint32_t S2CR        ; // 0x40 stream configuration register
    volatile uint32_t S2NDTR      ; // 0x44 stream number of data register
    volatile uint32_t S2PAR       ; // 0x48 stream peripheral address register
    volatile uint32_t S2M0AR      ; // 0x4C stream memory 0 address register
    volatile uint32_t S2M1AR      ; // 0x50 stream memory 1 address register
    volatile uint32_t S2FCR       ; // 0x54 stream FIFO control register
    volatile uint32_t S3CR        ; // 0x58 stream configuration register
    volatile uint32_t S3NDTR      ; // 0x5C stream number of data register
    volatile uint32_t S3PAR       ; // 0x60 stream peripheral address register
    volatile uint32_t S3M0AR      ; // 0x64 stream memory 0 address register
    volatile uint32_t S3M1AR      ; // 0x68 stream memory 1 address register
    volatile uint32_t S3FCR       ; // 0x6C stream FIFO control register
    volatile uint32_t S4CR        ; // 0x70 stream configuration register
    volatile uint32_t S4NDTR      ; // 0x74 stream number of data register
    volatile uint32_t S4PAR       ; // 0x78 stream peripheral address register
    volatile uint32_t S4M0AR      ; // 0x7C stream memory 0 address register
    volatile uint32_t S4M1AR      ; // 0x80 stream memory 1 address register
    volatile uint32_t S4FCR       ; // 0x84 stream FIFO control register
    volatile uint32_t S5CR        ; // 0x88 stream configuration register
    volatile uint32_t S5NDTR      ; // 0x8C stream number of data register
    volatile uint32_t S5PAR       ; // 0x90 stream peripheral address register
    volatile uint32_t S5M0AR      ; // 0x94 stream memory 0 address register
    volatile uint32_t S5M1AR      ; // 0x98 stream memory 1 address register
    volatile uint32_t S5FCR       ; // 0x9C stream FIFO control register
    volatile uint32_t S6CR        ; // 0xA0 stream configuration register
    volatile uint32_t S6NDTR      ; // 0xA4 stream number of data register
    volatile uint32_t S6PAR       ; // 0xA8 stream peripheral address register
    volatile uint32_t S6M0AR      ; // 0xAC stream memory 0 address register
    volatile uint32_t S6M1AR      ; // 0xB0 stream memory 1 address register
    volatile uint32_t S6FCR       ; // 0xB4 stream FIFO control register
    volatile uint32_t S7CR        ; // 0xB8 stream configuration register
    volatile uint32_t S7NDTR      ; // 0xBC stream number of data register
    volatile uint32_t S7PAR       ; // 0xC0 stream peripheral address register
    volatile uint32_t S7M0AR      ; // 0xC4 stream memory 0 address register
    volatile uint32_t S7M1AR      ; // 0xC8 stream memory 1 address register
    volatile uint32_t S7FCR       ; // 0xCC stream FIFO control register
} DMA2_TypeDef;

#define DMA2   ((DMA2_TypeDef *) 0x40026400UL)

