jbvalle/kx_regs/stm32f401re_regs.h
typedef struct {
    volatile uint32_t MODER       ; // 0x00 GPIO port mode register
    volatile uint32_t OTYPER      ; // 0x04 GPIO port output type register
    volatile uint32_t OSPEEDR     ; // 0x08 GPIO port output speed register
    volatile uint32_t PUPDR       ; // 0x0C GPIO port pull-up/pull-down register
    volatile uint32_t IDR         ; // 0x10 GPIO port input data register
    volatile uint32_t ODR         ; // 0x14 GPIO port output data register
    volatile uint32_t BSRR        ; // 0x18 GPIO port bit set/reset register
    volatile uint32_t LCKR        ; // 0x1C GPIO port configuration lock register
    volatile uint32_t AFRL        ; // 0x20 GPIO alternate function low register
    volatile uint32_t AFRH        ; // 0x24 GPIO alternate function high register
} GPIOH_TypeDef;

#define GPIOH   ((GPIOH_TypeDef *) 0x40021C00UL)

typedef struct {
    volatile uint32_t MODER       ; // 0x00 GPIO port mode register
    volatile uint32_t OTYPER      ; // 0x04 GPIO port output type register
    volatile uint32_t OSPEEDR     ; // 0x08 GPIO port output speed register
    volatile uint32_t PUPDR       ; // 0x0C GPIO port pull-up/pull-down register
    volatile uint32_t IDR         ; // 0x10 GPIO port input data register
    volatile uint32_t ODR         ; // 0x14 GPIO port output data register
    volatile uint32_t BSRR        ; // 0x18 GPIO port bit set/reset register
    volatile uint32_t LCKR        ; // 0x1C GPIO port configuration lock register
    volatile uint32_t AFRL        ; // 0x20 GPIO alternate function low register
    volatile uint32_t AFRH        ; // 0x24 GPIO alternate function high register
} GPIOB_TypeDef;

#define GPIOB   ((GPIOB_TypeDef *) 0x40020400UL)

typedef struct {
    volatile uint32_t MODER       ; // 0x00 GPIO port mode register
    volatile uint32_t OTYPER      ; // 0x04 GPIO port output type register
    volatile uint32_t OSPEEDR     ; // 0x08 GPIO port output speed register
    volatile uint32_t PUPDR       ; // 0x0C GPIO port pull-up/pull-down register
    volatile uint32_t IDR         ; // 0x10 GPIO port input data register
    volatile uint32_t ODR         ; // 0x14 GPIO port output data register
    volatile uint32_t BSRR        ; // 0x18 GPIO port bit set/reset register
    volatile uint32_t LCKR        ; // 0x1C GPIO port configuration lock register
    volatile uint32_t AFRL        ; // 0x20 GPIO alternate function low register
    volatile uint32_t AFRH        ; // 0x24 GPIO alternate function high register
} GPIOA_TypeDef;

#define GPIOA   ((GPIOA_TypeDef *) 0x40020000UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 Control register 1
    volatile uint32_t CR2         ; // 0x04 Control register 2
    volatile uint32_t OAR1        ; // 0x08 Own address register 1
    volatile uint32_t OAR2        ; // 0x0C Own address register 2
    volatile uint32_t DR          ; // 0x10 Data register
    volatile uint32_t SR1         ; // 0x14 Status register 1
    volatile uint32_t SR2         ; // 0x18 Status register 2
    volatile uint32_t CCR         ; // 0x1C Clock control register
    volatile uint32_t TRISE       ; // 0x20 TRISE register
} I2C3_TypeDef;

#define I2C3   ((I2C3_TypeDef *) 0x40005C00UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SR          ; // 0x08 status register
    volatile uint32_t DR          ; // 0x0C data register
    volatile uint32_t CRCPR       ; // 0x10 CRC polynomial register
    volatile uint32_t RXCRCR      ; // 0x14 RX CRC register
    volatile uint32_t TXCRCR      ; // 0x18 TX CRC register
    volatile uint32_t I2SCFGR     ; // 0x1C I2S configuration register
    volatile uint32_t I2SPR       ; // 0x20 I2S prescaler register
} I2S2EXT_TypeDef;

#define I2S2EXT   ((I2S2EXT_TypeDef *) 0x40003400UL)

#endif /* STM32F401_H */
